#=!
جولیا به عنوان یک زبان تخصصی انجام محاسبات، توابع متنوعی در موضوع محاسبات آماری (statistics) را تعریف و در اختیار کاربر قرار میدهد
علاوه بر این توابع پایه، مجموعه کاملتری از قابلیت ها در پکیجهای جانبی جولیا تعریف شده اند، فهرست مهمترین پکیجهای تخصصی ی آمار و احتمالات را میتوان با مراجعه به آدرس https://github.com/JuliaStats دریافت نمود. 
در ارائه مثالهای این یادداشت فرض براین است که خواننده از نحوه کار با 1- بردارها و آرایه ها در جولیا و 2- ماکروهای تست (Unit and Functional Testing) اطلاع دارد.
!=#

#=!
داده های آماری را بصورت ماتریسی از اعداد تصادفی تولید میکنیم
!=#
randomdata = rand((10,20)) #=> 10x20 Array{Float64,2}
meanval = mean(randomdata) #=> محاسبه مقدار متوسط داده ها
stdval = std(randomdata,1) #=> انحراف از معیار داده ها روی بعد اول 

