#=!
Julia ميتواند دفعات اجراء خطوط برنامه را شمارش نمايد، اين قابليت ميتواند کاربردهاي مختلفي داشته، به عنوان مثال آن جهت بررسي درصد پوشش توابع تست نوشته شده بهره گرفته ميشود. يافتن خطوطي از برنامه که هنگام اجراء توابع تست فراخوانده نميشوند از ان جهت اهميت دارد که برنامه نويس را در يافتن نواحي از کد که احتمال وجود خطا در آن وجود دارد ياري ميدهد. 
جهت فعال سازي اين قابليت لازم است Julia را با شرط زير فراخوانيد
!=#
# julia --code-coverage=user -e "include(\"code2coverage.jl\"); using Base.Test; @test fun(100) == 101"
#=!
فايل code2coverage تنها شامل تعريف يک تابع ميباشد، که مقدار ورودي را يا عدد 1 جمع کرده و حاصل را برميگرداند
!=#
function fun(len)
    N::Int=len;
    if(len>0)
      N+=1;
    else
      N-=1;
    end
    return N;
end
#=!
Julia در کنار code2coverage.jl فايل ديگري با نام code2coverage.jl.cov توليد مينمايد، اين فايل تعداد فراخوان هاي مترادف براي هر خط کد از فايل مرجع را گزارش مينمايد. 
!=#
#=
=#
